Tekla Open API Reference for Tekla Structures 2025
LoadPoint.Moment Property
 The moment vector. The values are given in the local coordinate system of the load (not in the current coordinate system).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Moment { get; set; }
Public Property Moment As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
LoadPoint Class
Tekla.Structures.Model Namespace